Repository: q-artem/VTprint
Catalog: locales/*/LC_MESSAGES/vt-print.po
Languages: ru

# to_start_work_send_pdf
source: Send a PDF file to start
ru: Для начала работы отправьте документ в формате PDF

source: Error. Try again.
ru: Ошибка. Попробуйте ещё раз.

# you_are_not_in_print_state
source: You not in print settings
ru: Вы не в настройках печати

# help
source: Welcome to the VTprint bot! Your group: {} Pages available per day: {} The printer is located at Kronverskiy Prospekt, 49, XXXXXXXXXX. To print a file, simply send it as a PDF to this chat, specify your desired print settings, and confirm the print job. If you'd like to report a bug, translation error, or any other issue, please use the /report command. To restart bot use the /start command. The printer is maintained by students, and printing is free of charge for you. Please treat it with care. To display this message again, use the /help command.
ru: Приветствуем Вас в боте VTprint! Ваша группа: {} Страниц в день доступно: {} Принтер находится на Кронверском проспекте, 49, XXXXXXXXXX. Чтобы напечатать файл, отправьте его в формате PDF в чат, укажите необходимые настройки и подтвердите печать. Если хотите сообщить об ошибке, неточности перевода и т. д., используйте команду /report. Для перезапуска бота - команда /start. Принтер поддерживается студентами, печать для вас бесплатна, поэтому, пожалуйста, давайте без вандализма в любом из его проявлений. Для вывода этого сообщения повторно - команда /help.

# using_report
source: Usage: <code>/report</code> &lt;your message&gt;
ru: Использование: <code>/report</code> &lt;ваше сообщение&gt;

source: Selected language: {}
ru: Выбран язык: {}

# file_is_not_pdf
source: Only PDF format is supported
ru: Поддерживаются только PDF-файлы

# file_is_too_big_max_is_20mb
source: The file is too big. Max size is 20MB. Try compressing it, you can do it <a href="https://www.ilovepdf.com/ru/compress_pdf">here</a>
ru: Файл слишком большой, максимальный размер файла - 20 МБ. Сожмите файл, например <a href="https://www.ilovepdf.com/ru/compress_pdf">здесь</a>

# file_processing_error
source: Your file could not be processed. Try restoring it or send another one. Error: {}
ru: Ваш файл не удается обработать. Попробуйте восстановить его или отправить другой. Ошибка: {}

# page_range_selecting_available_n_pages
source: Please type ranges of pages. For example: 1-5,7,8-10 Pages in file: {}. Pages available: {}
ru: Введите диапазоны страниц, например: 1-5,7,8-10 Страниц в файле: {}. Страниц доступно: {}

# too_many_pages_you_available_n
source: Too many pages, you available {}. New pages will be available tomorrow. Try again
ru: Слишком много страниц, вам доступно {}. Новые страницы станут доступны завтра. Попробуйте ещё раз

# pages_ranges_all_pages_from_n_available
source: Ranges accepted: "{}". Pages to print: {} (Available: {})
ru: Диапазоны заданы: "{}". Страниц к печати: {} (Доступно: {})

# canceled
source: Action canceled
ru: Действие отменено

# copies_amount_selecting_max_copies
source: Enter copies amount, max: 100
ru: Введите количество копий. Максимум: 100

# copies_amount_all_pages_from_n_available
source: Amount of copies accepted: {}. Pages to print: {} (Available: {})
ru: Количество копий задано: {}. Страниц к печати: {} (Доступно: {})

# confirm_printing_file
source: Confirm file printing
ru: Подтвердите печать файла

# file_sent_to_print
source: File has been successfully sent to printer ðŸŽ‰ Remaining pages: {}
ru: Файл успешно отправлен на печать 🎉 Остаток страниц: {}

# error_printing_file
source: An error has occurred. Try again later or report it with the /report command
ru: Произошла ошибка. Попробуйте позднее или сообщите о ней командой /report

source: Print canceled
ru: Печать отменена

# too_much_length_of_range_of_pages
source: Too long string (less than 100 symbols)
ru: Слишком сложно, давайте покороче (до 100 символов)

# wrong_range_of_pages
source: Invalid pages range
ru: Неверный диапазон страниц, попробуйте еще раз

# file_name
source: File name: <u>{}</u>
ru: Имя файла: <u>{}</u>

# file_size
source: File size: <u>{}</u>
ru: Размер файла: <u>{}</u>

# pages_amount
source: Pages amount: <u>{}</u>
ru: Количество страниц: <u>{}</u>

# pages_ranges
source: <b>Selected pages ranges:</b> <u>{}</u>
ru: <b>Выбранные диапазоны страниц:</b> <u>{}</u>

# copies_amount
source: <b>Copies amount:</b> <u>{}</u>
ru: <b>Количество копий:</b> <u>{}</u>

# pages_to_print
source: Pages to print: <u>{}</u>
ru: Страниц к печати: <u>{}</u>

# pages_available
source: <b>Pages available: <u>{}</u>. Reminds after print: <u>{}</u></b>
ru: <b>Доступно страниц: <u>{}</u>. Остаток после печати: <u>{}</u></b>

# you_are_not_enough_pages_set_range_or_try_later
source: <b><u>Insufficient print pages ({} needed). Specify page ranges, reduce copies amount or try again later.</u></b>
ru: <b><u>Вам не хватает страниц для печати, нужно еще {}. Задайте диапазоны, уменьшите количество копий или попробуйте позже</u></b>

# sure_to_print_or_change_params
source: <i>Confirm print or change parameters</i>
ru: <i>Подтвердите печать или измените параметры</i>

# please_enter_int
source: Enter a number
ru: Введите число

# int_must_be_between_1_and_100
source: The number must be between 1 and 100
ru: Число должно быть в диапазоне от 1 до 100

# choice_page_range
source: Set pages range
ru: Выбрать диапазон страниц

# choice_copies_amount
source: Select amount of copies
ru: Выбрать количество копий

# accept_print
source: Confirm print
ru: Подтвердить печать

source: Cancel print
ru: Отменить печать

source: Cancel
ru: Отменить

# confirm_print_file
source: Confirm file printing
ru: Подтвердить печать файла
